# System Zone Element Type Use Humidification Set Point Property

Source: https://www.revitapidocs.com/2026/09cce937-0a5a-44d1-9545-9c070a45f782.htm

---

| System Zone Element Type Use Humidification Set Point Property |
| --- |

Use the humidification set point.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool UseHumidificationSetPoint { get; set; }
```

```
Public Property UseHumidificationSetPoint As Boolean
	Get
	Set
```

```
public:
property bool UseHumidificationSetPoint {
	bool get ();
	void set (bool value);
}
```

```
member UseHumidificationSetPoint : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

SystemZoneElementType Class Autodesk.Revit.DB.Mechanical Namespace